package com.example.newproject;

public class QuestionAnswer {

    public static String question[] ={
        "Кто с кем воевал во время первой мировой войны?",
        "Кто первый начал первую мировую войну?",
        "Кто победил в первой мировой войне?",
        "Сколько лет была 1 мировая?",
        "Кто был агрессором в первой мировой войне?",
        "Кто помогал России в первой мировой войне?",
        "Сколько стран в Антанте?",
        "Что значит слово Антанта?",
        "Как создалась Антанта?",
        "Когда исчезла Антанта?"
    };

    public static String choices[][] ={
            {"Союзники против центральных держав", "Фашистская Германия и СССР", "Германия и Франция, другие страны были нейтральными", "Российское царство и Италия"},
            {"Италия", "Российское царство", "Австро-Венгрия" ,"Франция, которая желала отомстить Германии",},
            {"Германия", "Антанта", "Австро-Венгрия", "Турция"},
            {"1914-1915", "1910-1930", "1914-1920", "1914-1918"},
            {"Неоднозначно", "США", "Франция", "Россия"},
            {"Испания", "Китай", "Бразилия", "Антанта"},
            {"6 стран", "9 стран", "27 стран", "12 стран"},
            {"Северное сияние", "Сердечное согласие", "Союз государств", "Братство народов"},
            {"В результате религиозного объединения", "После международной футбольной лиги", "В результате договоренностей о свободной торговле", "В результате подписания мирного договора в 1907 году"},
            {"Не была официально распущена, но потеряла значение", "Она существует по сей день", "После первой мировой войны", "После Парижской конференции в 1919г.",}
    };

    public static String correctAnswers[] ={
            "Союзники против центральных держав",
            "Австро-Венгрия",
            "Антанта",
            "1914-1918",
            "Неоднозначно",
            "Антанта",
            "27 стран",
            "Сердечное согласие",
            "В результате подписания мирного договора в 1907 году",
            "Не была официально распущена, но потеряла значение"
    };
}
